
Feature: Вход в системата


  Scenario: Вход в системата с валидни потребителски данни
    Given Потребителя отваря екрана за вход в системата 
    When Въвежда потребителско име "Ivan"
    And Въвежда парола "pass1!"
    And Натиска бутон за вход в системата
    Then Вижда съобщение "OK".


  Scenario: Вход в системата с невалидни потребителски данни
    Given Потребителя отваря екрана за вход в системата 
    When Въвежда потребителско име "Ivan123"
    And Въвежда парола "pass123!"
    And Натиска бутон за вход в системата
    Then Вижда съобщение "Потребител с тези данни не съществува!".
    
      Scenario: Вход в системата без потребителско име
    Given Потребителя отваря екрана за вход в системата
    When Въвежда парола "pass123!"
    And Натиска бутон за вход в системата
    Then Вижда съобщение "Моля въведете потребителско име!".
    
    Scenario: Вход в системата без парола
    Given Потребителя отваря екрана за вход в системата
    When Въвежда потребителско име "Ivan123"
    And Натиска бутон за вход в системата
    Then Вижда съобщение "Моля въведете парола!".
     
    Scenario: Вход в системата без потребителски данни
    Given Потребителя отваря екрана за вход в системата
    When Натиска бутон за вход в системата
    Then Вижда съобщение "Моля въведете потребителско име и парола!".